# Importacion & almacenaje

In [4]:
import pandas as pd
import numpy as np

In [5]:
# URL del archivo CSV del DataFrame (fork de un Gist original)
url = 'https://gist.githubusercontent.com/dzapatasal/9f521528c196ef6e48732c7cf5a74516/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv'

# Lectura & carga
df = pd.read_csv(url,sep=',')
df

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   NaN      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   NaN      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   NaN      False
10    Danilo    21   NaN      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   NaN      False
15    Milena    29   7.0       True
16     Lucas    33   NaN      False
17     Nadia    34   8.0  Verdadero

In [6]:
# Verificando tipo de datos
type(df)

pandas.core.frame.DataFrame

# Exploracion inicial de los datos

In [7]:
# Visualizacion (7 primeras filas)
df.head(7)

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   NaN    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True
5    Bruna    23   NaN    False
6  Daniela    21   7.0     True

In [10]:
# Visualizacion (5 últimas filas)
df.tail(5)

    Nombre  Edad  Nota   Aprobado
13  Miriam    25   9.0       True
14   Pablo    37   NaN      False
15  Milena    29   7.0       True
16   Lucas    33   NaN      False
17   Nadia    34   8.0  Verdadero

In [13]:
# Verificacion de cantidad de fila
df.shape
# En total 18 filas, 4 columnas

(18, 4)

In [14]:
# Verificación de tipo de dato
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    18 non-null     object
 1   Edad      18 non-null     int64
 2   Nota      12 non-null     float64
 3   Aprobado  18 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 704.0+ bytes

In [16]:
# Verifacion del nombre de las columnas (etiquetas)
df.columns

Index(['Nombre', 'Edad', 'Nota', 'Aprobado'], dtype='object')